[Killed] StringLiteral
src/components/Pokemon.js:21:14
           <p data-testid="pokemon-name">{`${name}`}</p>
           <p data-testid="pokemon-type">{`${type}`}</p>
           <p data-testid="pokemon-weight">
-            {`Average weight: ${value} ${measurementUnit}`}
+            {``}
           </p>
           {showDetailsLink && <Link to={ `/pokemon/${id}` }>More details</Link>}
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test


FAIL src/tests/Pokemon.test.js (6.381 s)

  Teste o componente <Pokemon.js />

[Killed] StringLiteral
src/components/Pokemon.js:23:42
           <p data-testid="pokemon-weight">
             {`Average weight: ${value} ${measurementUnit}`}
           </p>
-          {showDetailsLink && <Link to={ `/pokemon/${id}` }>More details</Link>}
+          {showDetailsLink && <Link to={ `` }>More details</Link>}
         </div>
         <img src={ `${image}` } alt={ `${name} sprite` } />
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test


FAIL src/tests/Pokemon.test.js (6.47 s)

  Teste o componente <Pokemon.js />

[Killed] StringLiteral
src/components/Pokemon.js:30:19
           <img
             className="favorite-icon"
             src={ `/star-icon.svg` }
-            alt={ `${name} is marked as favorite` }
+            alt={ `` }
           />
         )}
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> react-scripts test


FAIL src/tests/Pokemon.test.js (6.099 s)

  Teste o componente <Pokemon.js />
