[Killed] BlockStatement
src/services/sale.service.js:5:29
 const mapJoiError = require('./validations/mapJoiError');
 const { validateCreateSaleData } = require('./validations/validateInputValues');
 
-const listAll = async () => {
-  const sales = await saleModel.findAll();
-  return { status: 'SUCCESSFUL', data: sales };
-};
+const listAll = async () => {};
 const findOne = async (saleId) => {
   const sale = await saleModel.findById(saleId);
killedBy: Realizando teste - Sale Service Recupera todos as vendas com sucesso
statusReason: Cannot destructure property 'data' of '(intermediate value)' as it is undefined.

[Killed] BlockStatement
src/services/sale.service.js:9:35
   const sales = await saleModel.findAll();
   return { status: 'SUCCESSFUL', data: sales };
 };
-const findOne = async (saleId) => {
-  const sale = await saleModel.findById(saleId);
-  if (sale.length === 0 || !sale) {
-    return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
-  }
-  return { status: 'SUCCESSFUL', data: sale };
-};
+const findOne = async (saleId) => {};
 
 const verifyIfProductsExists = async (saleData) => {
killedBy: Realizando teste - Sale Service Recupera venda pelo ID com sucesso
statusReason: Cannot destructure property 'status' of '(intermediate value)' as it is undefined.

[Killed] EqualityOperator
src/services/sale.service.js:11:7
 };
 const findOne = async (saleId) => {
   const sale = await saleModel.findById(saleId);
-  if (sale.length === 0 || !sale) {
+  if (sale.length !== 0 || !sale) {
     return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
   }
killedBy: Realizando teste - Sale Service Recupera venda pelo ID com sucesso
statusReason: expected 'NOT_FOUND' to equal 'SUCCESSFUL'

[Killed] ConditionalExpression
src/services/sale.service.js:11:7
 };
 const findOne = async (saleId) => {
   const sale = await saleModel.findById(saleId);
-  if (sale.length === 0 || !sale) {
+  if (true) {
     return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
   }
killedBy: Realizando teste - Sale Service Recupera venda pelo ID com sucesso
statusReason: expected 'NOT_FOUND' to equal 'SUCCESSFUL'

[Survived] BlockStatement
src/services/sale.service.js:17:52
   return { status: 'SUCCESSFUL', data: sale };
 };
 
-const verifyIfProductsExists = async (saleData) => {
-  let productNotFound = false;
-
-  const promises = saleData.map(async (data) => {
-    const product = await productModel.findById(data.productId);
-
-    if (!product) {
-      productNotFound = true;
-    }
-  });
-
-  await Promise.all(promises);
-
-  return productNotFound;
-};
+const verifyIfProductsExists = async (saleData) => {};
 
 const create = async (saleData) => {

[Killed] BooleanLiteral
src/services/sale.service.js:18:25
 };
 
 const verifyIfProductsExists = async (saleData) => {
-  let productNotFound = false;
+  let productNotFound = true;
 
   const promises = saleData.map(async (data) => {
killedBy: Realizando teste - Sale Service Cria venda com sucesso
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[Survived] BlockStatement
src/services/sale.service.js:20:49
 const verifyIfProductsExists = async (saleData) => {
   let productNotFound = false;
 
-  const promises = saleData.map(async (data) => {
-    const product = await productModel.findById(data.productId);
-
-    if (!product) {
-      productNotFound = true;
-    }
-  });
+  const promises = saleData.map(async (data) => {});
 
   await Promise.all(promises);

[Killed] BooleanLiteral
src/services/sale.service.js:23:9
   const promises = saleData.map(async (data) => {
     const product = await productModel.findById(data.productId);
 
-    if (!product) {
+    if (product) {
       productNotFound = true;
     }
killedBy: Realizando teste - Sale Service Cria venda com sucesso
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[Killed] ConditionalExpression
src/services/sale.service.js:23:9
   const promises = saleData.map(async (data) => {
     const product = await productModel.findById(data.productId);
 
-    if (!product) {
+    if (true) {
       productNotFound = true;
     }
killedBy: Realizando teste - Sale Service Cria venda com sucesso
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[NoCoverage] BooleanLiteral
src/services/sale.service.js:24:25
     const product = await productModel.findById(data.productId);
 
     if (!product) {
-      productNotFound = true;
+      productNotFound = false;
     }
   });

[Killed] BlockStatement
src/services/sale.service.js:33:36
   return productNotFound;
 };
 
-const create = async (saleData) => {
-  const error = validateCreateSaleData(saleData);
-
-  if (error) {
-    return { status: mapJoiError(error.type), data: { message: error.message } };
-  }
-
-  const productNotFound = await verifyIfProductsExists(saleData);
-
-  if (productNotFound) {
-    return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  }
-
-  const saleId = await saleModel.insert(saleData);
-
-  const newSale = {
-    id: saleId,
-    itemsSold: saleData,
-  };
-  return { status: 'CREATED', data: newSale };
-};
+const create = async (saleData) => {};
 module.exports = {
   listAll,
killedBy: Realizando teste - Sale Service Cria venda com sucesso
statusReason: Cannot destructure property 'status' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/services/sale.service.js:36:7
 const create = async (saleData) => {
   const error = validateCreateSaleData(saleData);
 
-  if (error) {
+  if (true) {
     return { status: mapJoiError(error.type), data: { message: error.message } };
   }
killedBy: Realizando teste - Sale Service Cria venda com sucesso
statusReason: Cannot read properties of undefined (reading 'type')

[NoCoverage] BlockStatement
src/services/sale.service.js:36:14
 const create = async (saleData) => {
   const error = validateCreateSaleData(saleData);
 
-  if (error) {
-    return { status: mapJoiError(error.type), data: { message: error.message } };
-  }
+  if (error) {}
 
   const productNotFound = await verifyIfProductsExists(saleData);

[Killed] ConditionalExpression
src/services/sale.service.js:42:7
 
   const productNotFound = await verifyIfProductsExists(saleData);
 
-  if (productNotFound) {
+  if (true) {
     return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   }
killedBy: Realizando teste - Sale Service Cria venda com sucesso
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[Survived] ConditionalExpression
src/services/sale.service.js:42:7
 
   const productNotFound = await verifyIfProductsExists(saleData);
 
-  if (productNotFound) {
+  if (false) {
     return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   }
