[Killed] BlockStatement
src/services/validations/validateInputValues.js:3:52
 const { addProductSchema, addSaleSchema } = require('./schemas');
 
-const validateCreateProductData = (productData) => {
-  const { error } = addProductSchema.validate(productData);
-  if (error) {
-    return { type: error.details[0].type, message: error.message };
-  }
-};
+const validateCreateProductData = (productData) => {};
 
 const validateCreateSaleData = (saleData) => {
killedBy: Realizando teste - Product Service Não cria um produto passando dados inválidos
statusReason: expected 'CREATED' to equal 'INVALID_VALUES'

[Killed] ConditionalExpression
src/services/validations/validateInputValues.js:5:7
 
 const validateCreateProductData = (productData) => {
   const { error } = addProductSchema.validate(productData);
-  if (error) {
+  if (true) {
     return { type: error.details[0].type, message: error.message };
   }
killedBy: Realizando teste - Product Service Cria um produto com sucesso
statusReason: Cannot read properties of undefined (reading 'details')

[Killed] ConditionalExpression
src/services/validations/validateInputValues.js:5:7
 
 const validateCreateProductData = (productData) => {
   const { error } = addProductSchema.validate(productData);
-  if (error) {
+  if (false) {
     return { type: error.details[0].type, message: error.message };
   }
killedBy: Realizando teste - Product Service Não cria um produto passando dados inválidos
statusReason: expected 'CREATED' to equal 'INVALID_VALUES'

[Survived] BlockStatement
src/services/validations/validateInputValues.js:10:46
   }
 };
 
-const validateCreateSaleData = (saleData) => {
-  const { error } = addSaleSchema.validate(saleData);
-
-  if (error) {
-    return { type: error.details[0].type, message: error.message };
-  }
-};
+const validateCreateSaleData = (saleData) => {};
 
 module.exports = {
