[Killed] BlockStatement
src/controllers/product.controller.js:4:47
 const { productService } = require('../services');
 const mapHttpStatus = require('../utils/mapHttpStatus');
 
-const listAll = async (_request, response) => {
-  const { status, data } = await productService.listAll();
-  return response.status(mapHttpStatus(status)).json(data);
-};
+const listAll = async (_request, response) => {};
 const findOne = async (request, response) => {
   const { productId } = request.params;
killedBy: Realizando teste - Product Controller Recupera todos os produtos com sucesso
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/product.controller.js:8:46
   const { status, data } = await productService.listAll();
   return response.status(mapHttpStatus(status)).json(data);
 };
-const findOne = async (request, response) => {
-  const { productId } = request.params;
-  const { status, data } = await productService.findOne(productId);
-  return response.status(mapHttpStatus(status)).json(data);
-};
+const findOne = async (request, response) => {};
 
 const create = async (request, response) => {
killedBy: Realizando teste - Product Controller Recupera um produto pelo ID com sucesso
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/product.controller.js:14:45
   return response.status(mapHttpStatus(status)).json(data);
 };
 
-const create = async (request, response) => {
-  const productData = request.body;
-
-  const { status, data } = await productService.create(productData);
-
-  return response.status(mapHttpStatus(status)).json(data);
-};
+const create = async (request, response) => {};
 
 module.exports = {
killedBy: Realizando teste - Product Controller Cria um produto com sucesso
statusReason: expected stub to have been called with arguments 201
