[Killed] BlockStatement
src/controllers/sale.controller.js:4:47
 const { saleService } = require('../services');
 const mapHttpStatus = require('../utils/mapHttpStatus');
 
-const listAll = async (_request, response) => {
-  const { status, data } = await saleService.listAll();
-
-  return response.status(mapHttpStatus(status)).json(data);
-};
+const listAll = async (_request, response) => {};
 
 const findOne = async (request, response) => {
killedBy: Realizando teste - Sale Controller Recupera todas as vendas com sucesso
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/sale.controller.js:10:46
   return response.status(mapHttpStatus(status)).json(data);
 };
 
-const findOne = async (request, response) => {
-  const { saleId } = request.params;
-
-  const { status, data } = await saleService.findOne(saleId);
-
-  return response.status(mapHttpStatus(status)).json(data);
-};
+const findOne = async (request, response) => {};
 
 const create = async (request, response) => {
killedBy: Realizando teste - Sale Controller Recupera uma venda pelo ID com sucesso
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/sale.controller.js:18:45
   return response.status(mapHttpStatus(status)).json(data);
 };
 
-const create = async (request, response) => {
-  const saleData = request.body;
-
-  const { status, data } = await saleService.create(saleData);
-
-  return response.status(mapHttpStatus(status)).json(data);
-};
+const create = async (request, response) => {};
 
 module.exports = { 
killedBy: Realizando teste - Sale Controller Cria uma venda com sucesso
statusReason: expected stub to have been called with arguments 201
