[Killed] BlockStatement
src/models/product.model.js:9:29
   getFormattedPlaceholders,
 } = require('../utils/generateFormattedQuery');
 
-const findAll = async () => {
-  const query = 'SELECT * FROM products;';
-  const [products] = await connection.execute(query);
-  return camelize(products);
-};
+const findAll = async () => {};
 const findById = async (productId) => {
   const query = 'SELECT * FROM products WHERE id = ?;';
killedBy: Realizando teste - Product Model Recupera todos os produtos com sucesso
statusReason: expected undefined to be an instance of Array

[Killed] BlockStatement
src/models/product.model.js:14:39
   const [products] = await connection.execute(query);
   return camelize(products);
 };
-const findById = async (productId) => {
-  const query = 'SELECT * FROM products WHERE id = ?;';
-  const [[product]] = await connection.execute(query, [productId]);
-  return camelize(product);
-};
+const findById = async (productId) => {};
 
 const insert = async (productData) => {
killedBy: Realizando teste - Product Model Recupera um produto pelo ID com sucesso
statusReason: expected undefined to be an instance of Object

[Killed] BlockStatement
src/models/product.model.js:20:39
   return camelize(product);
 };
 
-const insert = async (productData) => {
-  const formattedColumns = getFormattedColumnNames(productData);
-  const formattedPlaceholders = getFormattedPlaceholders(productData);
-
-  const query = `INSERT INTO products(${formattedColumns}) VALUES(${formattedPlaceholders})`;
-
-  const [{ insertId }] = await connection.execute(query, Object.values(productData)); // [{insertId}]
-
-  return insertId;
-};
+const insert = async (productData) => {};
 
 module.exports = {
killedBy: Realizando teste - Product Model Cria um produto com sucesso
statusReason: expected undefined to equal 3
