[Killed] BlockStatement
src/models/sale.model.js:9:29
   getFormattedPlaceholders,
 } = require('../utils/generateFormattedQuery');
 
-const findAll = async () => {
-  const query = `SELECT s.id as sale_id, s.date, sp.product_id, sp.quantity FROM sales as s
-  LEFT JOIN sales_products as sp ON s.id = sp.sale_id
-  ORDER BY s.id, sp.product_id;`;
-  const [sales] = await connection.execute(query); // [[sales], [buffer ]]
-  return camelize(sales);
-};
+const findAll = async () => {};
 const findById = async (saleId) => {
   const query = `SELECT s.date, sp.product_id, sp.quantity FROM sales_products as sp 
killedBy: Realizando teste - Sale Model Recupera todas as vendas com sucesso
statusReason: expected undefined to be an instance of Array

[Killed] BlockStatement
src/models/sale.model.js:16:36
   const [sales] = await connection.execute(query); // [[sales], [buffer ]]
   return camelize(sales);
 };
-const findById = async (saleId) => {
-  const query = `SELECT s.date, sp.product_id, sp.quantity FROM sales_products as sp 
-  LEFT JOIN sales as s ON sp.sale_id  = s.id
-  WHERE sp.sale_id = ?;`;
-  const [sale] = await connection.execute(query, [saleId]); // [[sales], [buffer ]]
-  return camelize(sale);
-};
+const findById = async (saleId) => {};
 
 const insert = async (saleData) => {
killedBy: Realizando teste - Sale Model Recupera venda pelo ID com sucesso
statusReason: expected undefined to be an instance of Object

[Killed] BlockStatement
src/models/sale.model.js:24:36
   return camelize(sale);
 };
 
-const insert = async (saleData) => {
-  const nowDateTime = new Date().toISOString().slice(0, 19).replace('T', ' ');
-  const querySale = `INSERT INTO sales(date) VALUES("${nowDateTime}")`;
-  const [{ insertId: saleId }] = await connection.execute(querySale);
-
-  const mapSaleData = saleData.map((data) => ({ ...data, saleId }));
-
-  const promises = mapSaleData.map((mappedSaleData) => {
-    const formattedColumns = getFormattedColumnNames(mappedSaleData);
-    const formattedPlaceholders = getFormattedPlaceholders(mappedSaleData);
-
-    const query = `INSERT INTO sales_products(${formattedColumns})
-    VALUES(${formattedPlaceholders});`;
-    return connection.execute(query, Object.values(mappedSaleData));
-  });
-
-  await Promise.all(promises);
-
-  return saleId;
-};
+const insert = async (saleData) => {};
 
 module.exports = {
killedBy: Realizando teste - Sale Model Cria venda com sucesso
statusReason: expected undefined to equal 2

[Survived] MethodExpression
src/models/sale.model.js:25:23
 };
 
 const insert = async (saleData) => {
-  const nowDateTime = new Date().toISOString().slice(0, 19).replace('T', ' ');
+  const nowDateTime = new Date().toISOString().replace('T', ' ');
   const querySale = `INSERT INTO sales(date) VALUES("${nowDateTime}")`;
   const [{ insertId: saleId }] = await connection.execute(querySale);

[Survived] BlockStatement
src/models/sale.model.js:31:56
 
   const mapSaleData = saleData.map((data) => ({ ...data, saleId }));
 
-  const promises = mapSaleData.map((mappedSaleData) => {
-    const formattedColumns = getFormattedColumnNames(mappedSaleData);
-    const formattedPlaceholders = getFormattedPlaceholders(mappedSaleData);
-
-    const query = `INSERT INTO sales_products(${formattedColumns})
-    VALUES(${formattedPlaceholders});`;
-    return connection.execute(query, Object.values(mappedSaleData));
-  });
+  const promises = mapSaleData.map((mappedSaleData) => {});
 
   await Promise.all(promises);
