[Killed] BlockStatement
src/services/product.service.js:5:29
 const mapJoiError = require('./validations/mapJoiError');
 const { validateCreateProductData } = require('./validations/validateInputValues');
 
-const listAll = async () => {
-  const products = await productModel.findAll();
-  return { status: 'SUCCESSFUL', data: products };
-};
+const listAll = async () => {};
 const findOne = async (productId) => {
   const product = await productModel.findById(productId);
killedBy: Realizando teste - Product Service Recupera todos os produtos com sucesso
statusReason: Cannot destructure property 'status' of '(intermediate value)' as it is undefined.

[Killed] BlockStatement
src/services/product.service.js:9:38
   const products = await productModel.findAll();
   return { status: 'SUCCESSFUL', data: products };
 };
-const findOne = async (productId) => {
-  const product = await productModel.findById(productId);
-  if (!product) {
-    return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  }
-  return { status: 'SUCCESSFUL', data: product };
-};
+const findOne = async (productId) => {};
 
 const create = async (productData) => {
killedBy: Realizando teste - Product Service Recupera um produto pelo ID com sucesso
statusReason: Cannot destructure property 'status' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/services/product.service.js:11:7
 };
 const findOne = async (productId) => {
   const product = await productModel.findById(productId);
-  if (!product) {
+  if (true) {
     return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   }
killedBy: Realizando teste - Product Service Recupera um produto pelo ID com sucesso
statusReason: expected 'NOT_FOUND' to equal 'SUCCESSFUL'

[Killed] BlockStatement
src/services/product.service.js:11:17
 };
 const findOne = async (productId) => {
   const product = await productModel.findById(productId);
-  if (!product) {
-    return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  }
+  if (!product) {}
   return { status: 'SUCCESSFUL', data: product };
 };
killedBy: Realizando teste - Product Service Não recupera um produto pelo ID com id inexistente
statusReason: expected 'SUCCESSFUL' to equal 'NOT_FOUND'

[Killed] BlockStatement
src/services/product.service.js:17:39
   return { status: 'SUCCESSFUL', data: product };
 };
 
-const create = async (productData) => {
-  const error = validateCreateProductData(productData);
-
-  if (error) {
-    return { status: mapJoiError(error.type), data: { message: error.message } };
-  }
-
-  const productId = await productModel.insert(productData);
-
-  const newProduct = {
-    id: productId,
-    ...productData,
-  };
-  return { status: 'CREATED', data: newProduct };
-};
+const create = async (productData) => {};
 module.exports = {
   listAll,
killedBy: Realizando teste - Product Service Cria um produto com sucesso
statusReason: Cannot destructure property 'status' of '(intermediate value)' as it is undefined.
