[Killed] ConditionalExpression
src/services/validations/mapJoiError.js:6:39
   'string.min': 'INVALID_VALUES',
 };
 
-const mapJoiError = (joiErrorType) => joiError[joiErrorType] || 'INVALID_VALUES';
+const mapJoiError = (joiErrorType) => true;
 
 module.exports = mapJoiError;
killedBy: Realizando teste - Product Service Não cria um produto passando dados inválidos
statusReason: expected true to equal 'INVALID_VALUES'

[Killed] ConditionalExpression
src/services/validations/mapJoiError.js:6:39
   'string.min': 'INVALID_VALUES',
 };
 
-const mapJoiError = (joiErrorType) => joiError[joiErrorType] || 'INVALID_VALUES';
+const mapJoiError = (joiErrorType) => false;
 
 module.exports = mapJoiError;
killedBy: Realizando teste - Product Service Não cria um produto passando dados inválidos
statusReason: expected false to equal 'INVALID_VALUES'
