[Killed] ConditionalExpression
src/utils/mapHttpStatus.js:9:35
   INVALID_VALUES: 422,
 };
 
-const mapHttpStatus = (status) => httpStatusCode[status] || 500;
+const mapHttpStatus = (status) => true;
 
 module.exports = mapHttpStatus;
killedBy: Realizando teste - Product Controller Recupera todos os produtos com sucesso
statusReason: expected status to have been called with arguments 200
true 200

[Killed] LogicalOperator
src/utils/mapHttpStatus.js:9:35
   INVALID_VALUES: 422,
 };
 
-const mapHttpStatus = (status) => httpStatusCode[status] || 500;
+const mapHttpStatus = (status) => httpStatusCode[status] && 500;
 
 module.exports = mapHttpStatus;
killedBy: Realizando teste - Product Controller Recupera todos os produtos com sucesso
statusReason: expected status to have been called with arguments 200
500 200
